leetcode_2426_number_of_pairs_satisfying_inequality.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2426. Number of Pairs Satisfying Inequality</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2426. Number of Pairs Satisfying Inequality</h1>
<ul class="org-ul">
<li><a href="pattern_compute_values_for_all_pair_in_array.html#ID-B0C2170B-0DDA-4E0C-B03A-998F29ABDF97">Pattern: Compute values for all pair in array</a>.  <a href="can_we_simplify_the_problem_which_keeping_it_the_same.html#ID-F19C9539-EE46-41EE-8DEF-24C3076C6DC2">Can we simplify the problem while keeping it the same?</a>  The condition can be stated as \(n_1[i]-n_2[i]-diff \leq n_1[j]-n_2[j]\).  <a href="can_we_state_the_problem_as_result_of_multiple_searches.html#ID-3ECFA6C4-B482-49CA-B8C6-C67DA07B6EAE">Can we state the problem as result of multiple searches?</a>  For each position \(i\), we search for the smallest \(j\) that satisfy the condition.  Time complexity is \(O(n \log n)\) and space is \(O(n)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList
<span style="font-weight: bold;">from</span> typing <span style="font-weight: bold;">import</span> List

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">numberOfPairs</span>(<span style="font-weight: bold;">self</span>, nums1: List[<span style="font-weight: bold;">int</span>], nums2: List[<span style="font-weight: bold;">int</span>], diff: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(nums1)
        <span style="font-weight: bold; font-style: italic;">s</span> = SortedList()
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N - 1, -1, -1):
            <span style="font-weight: bold; font-style: italic;">ans</span> += <span style="font-weight: bold;">len</span>(s) - s.bisect_left(nums1[i] - nums2[i] - diff)
            s.add(nums1[i] - nums2[i])
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</body>
</html>